DataProcessors/УправлениеРеле.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>УправлениеРеле</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключитьВыключитьРеле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееСостояниеРеле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияТекущегоСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициирующийПроцесс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/УправлениеРеле/Ext/ObjectModule.bsl
//Реле должно быть подключено к цифровому пину

Процедура ПроцессДляСервераВключениеВыключениеРеле(Процесс = "") Экспорт
	
	 ИнициирующийПроцесс = Процесс;
	 
	 ИнициализацияУправлениеЧтениеРеле();	
	 ОтправитьКомандуНаРеле();
	 ДатаПолученияТекущегоСостояния = '00010101';
     ПолучитьСостояниеРеле();
	
	Если ДатаПолученияТекущегоСостояния <> '00010101' Тогда 
		ЗаписатьТекущееДанные();	
	КонецЕсли;

КонецПроцедуры

Процедура ПроцессДляСервераЧтениеФактическогоСостоянияРеле(Процесс = "") Экспорт
	
	ИнициирующийПроцесс = Процесс;
	
	ИнициализацияЧтениеСостоянияРеле();
	ДатаПолученияТекущегоСостояния = '00010101';
	ПолучитьСостояниеРеле();
	
	Если ДатаПолученияТекущегоСостояния <> '00010101' Тогда 
		ЗаписатьТекущееДанные();	
	КонецЕсли;
	
КонецПроцедуры

//////
Процедура ИнициализацияУправлениеЧтениеРеле()
	
	Ответ = ЗаполнитьПины();
	Если ЗначениеЗаполнено(Ответ) Тогда 
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + " " + Ответ;
	КонецЕсли;

	Ответ = ЗаполнитьНастройкиУправленияРеле();
	Если ЗначениеЗаполнено(Ответ) Тогда 
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + " " + Ответ;
	КонецЕсли;
	
КонецПроцедуры
Функция  ЗаполнитьНастройкиУправленияРеле() 
	
	СообщениеСНенайденнымиНастройками = "";
	
	// Настройки в реквизитах
	СтрокаСТабСНастройкамиРеквизитов = Оборудование.Настройки.Найти("Реквизиты",  "Наименование");
	Если СтрокаСТабСНастройкамиРеквизитов = Неопределено Тогда 
		СообщениеСНенайденнымиНастройками = СообщениеСНенайденнымиНастройками + "Не заполнена настройка для реквизитов ""Реквизиты"" (В справочнике оборудование); ";
	Иначе
		ТабСНастройкамиРеквизитов = СтрокаСТабСНастройкамиРеквизитов.Настройка.ТаблицаНастроек;
				
		СтрокаСПараметром = ТабСНастройкамиРеквизитов.Найти("ВключитьВыключитьРеле", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			СообщениеСНенайденнымиНастройками = СообщениеСНенайденнымиНастройками + "Не указан параметр ""ВключитьВыключитьРеле""; ";
		Иначе
			ВключитьВыключитьРеле = СтрокаСПараметром.Значение;
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат СообщениеСНенайденнымиНастройками;

КонецФункции
Процедура ОтправитьКомандуНаРеле()
	
	К._pinModeOUTPUT_digitalWrite(Оборудование, НомерПина, ?(ВключитьВыключитьРеле, 1, 0));
	
КОнецПроцедуры

Функция ЗаполнитьПины() 
	
	СообщениеСНенайденнымиПинами = "";
	
	СтрокаСНастройкой = Оборудование.Пины.Найти("Реле", "Наименование");
	Если СтрокаСНастройкой = Неопределено Тогда 
		СообщениеСНенайденнымиПинами = СообщениеСНенайденнымиПинами + "Не задан ПИН для ""Реле""; ";
	Иначе
		НомерПина = СтрокаСНастройкой.НомерПина;
	КонецЕсли;
	
	Возврат СообщениеСНенайденнымиПинами;
	
КонецФункции

Процедура ИнициализацияЧтениеСостоянияРеле()
		
	Ответ = ЗаполнитьПины();
	Если ЗначениеЗаполнено(Ответ) Тогда 
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + " " + Ответ;
	КонецЕсли;
	
КонецПроцедуры
Процедура ПолучитьСостояниеРеле()
	
	Ответ = К.digitalRead(Оборудование, НомерПина); 

	Если ТипЗнч(Ответ) = Тип("Число") Тогда 
		ТекущееСостояниеРеле = Ответ;
		ДатаПолученияТекущегоСостояния = ТекущаяДата();
	Иначе
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + "Не удалось получить состояние реле";
	КонецЕсли;	
	
КонецПроцедуры
/////	

Процедура ЗаписатьТекущееДанные()
	
	ОбщегоНазначения.ЗаписатьДанныеОборудования(Оборудование, "СостояниеРеле", ТекущееСостояниеРеле, ДатаПолученияТекущегоСостояния); 
	
КонецПроцедуры
